
## Aula 10: Modelo Final



```
=============================================================================================================
Model:                              Logit                          Pseudo R-squared:               0.161     
Dependent Variable:                 y['default']                   AIC:                            13326.6483
Date:                               2021-03-25 14:57               BIC:                            13425.3911
No. Observations:                   14700                          Log-Likelihood:                 -6650.3   
Df Model:                           12                             LL-Null:                        -7923.7   
Df Residuals:                       14687                          LLR p-value:                    0.0000    
Converged:                          1.0000                         Scale:                          1.0000    
No. Iterations:                     6.0000                                                                   
-------------------------------------------------------------------------------------------------------------
                                                               Coef.  Std.Err.    z    P>|z|   [0.025  0.975]
-------------------------------------------------------------------------------------------------------------
Intercept                                                     -0.8007   0.0832 -9.6239 0.0000 -0.9637 -0.6376
C(PAY_AMT1, Treatment(reference=0))[T.[21.50, 4902.50)]       -0.1828   0.0632 -2.8935 0.0038 -0.3067 -0.0590
C(PAY_AMT1, Treatment(reference=0))[T.[4902.50, inf)]         -0.3593   0.0828 -4.3407 0.0000 -0.5215 -0.1971
C(LIMIT_BAL, Treatment(reference=0))[T.[125000.00, inf)]      -0.4282   0.0654 -6.5517 0.0000 -0.5563 -0.3001
C(LIMIT_BAL, Treatment(reference=0))[T.[45000.00, 125000.00)] -0.2545   0.0631 -4.0331 0.0001 -0.3782 -0.1308
C(PAY_0, Treatment(reference=0))[T.[1]]                        0.8283   0.0639 12.9682 0.0000  0.7031  0.9535
C(PAY_0, Treatment(reference=0))[T.[6 5 8 4 2 3 7]]            2.4122   0.0623 38.6975 0.0000  2.2900  2.5344
C(PAY_AMT2, Treatment(reference=0))[T.[4966.50, inf)]         -0.1472   0.0814 -1.8076 0.0707 -0.3069  0.0124
C(PAY_AMT2, Treatment(reference=0))[T.[91.00, 4966.50)]       -0.1332   0.0599 -2.2236 0.0262 -0.2506 -0.0158
C(PAY_AMT3, Treatment(reference=0))[T.[1.50, 2918.50)]        -0.2373   0.0609 -3.8982 0.0001 -0.3566 -0.1180
C(PAY_AMT3, Treatment(reference=0))[T.[2918.50, inf)]         -0.1920   0.0736 -2.6074 0.0091 -0.3363 -0.0477
C(AVG_PAY, Treatment(reference=0))[T.[10116.92, inf)]         -0.6714   0.1071 -6.2716 0.0000 -0.8812 -0.4616
C(AVG_PAY, Treatment(reference=0))[T.[2217.08, 10116.92)]     -0.2621   0.0639 -4.0988 0.0000 -0.3874 -0.1368
=============================================================================================================
```

In [1]:
import pandas as pd

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [36]:
df = pd.read_csv('/content/drive/MyDrive/Curso_Logistica/dataset_trat.csv',sep=';')
df.head()

   ID   SAFRA  LIMIT_BAL  SEX  ...  PAY_AMT4  PAY_AMT5  PAY_AMT6  default
0   1  200510      20000    2  ...         0         0         0        1
1   2  200510     120000    2  ...      1000         0      2000        1
2   3  200510      90000    2  ...      1000      1000      5000        0
3   4  200510      50000    2  ...      1100      1069      1000        0
4   5  200510      50000    1  ...      9000       689       679        0

[5 rows x 26 columns]

### Transformações

In [37]:
df['AVG_PAY'] =  (df['PAY_AMT1'] + df['PAY_AMT2'] + df['PAY_AMT3'] + df['PAY_AMT4'] + df['PAY_AMT5'] + df['PAY_AMT6'])/ 6

df.loc[df['PAY_AMT2'] > 18987.5 , 'PAY_AMT2'] = 18987.5
df.loc[df['PAY_AMT3'] > 15500.7 , 'PAY_AMT3'] = 15500.7

### Manter apenas as variáveis finais no conjunto de dados

In [38]:
df=df[['ID','SAFRA','LIMIT_BAL','PAY_0','AVG_PAY','PAY_AMT1','PAY_AMT2','PAY_AMT3','default']]
df.head()

   ID   SAFRA  LIMIT_BAL  PAY_0  ...  PAY_AMT1  PAY_AMT2  PAY_AMT3  default
0   1  200510      20000      2  ...         0     689.0       0.0        1
1   2  200510     120000     -1  ...         0    1000.0    1000.0        1
2   3  200510      90000      0  ...      1518    1500.0    1000.0        0
3   4  200510      50000      0  ...      2000    2019.0    1200.0        0
4   5  200510      50000     -1  ...      2000   18987.5   10000.0        0

[5 rows x 9 columns]

### Transformações Finais

In [29]:
df.loc[df['LIMIT_BAL'] < 45000.00 , 'LIMIT_BAL_trat'] = 'C0'
df.loc[(df['LIMIT_BAL'] >= 45000.00) & (df['LIMIT_BAL'] < 125000.00), 'LIMIT_BAL_trat'] = 'C1'
df.loc[df['LIMIT_BAL'] >= 125000.00, 'LIMIT_BAL_trat'] = 'C2'

In [34]:
df['LIMIT_BAL_trat'].value_counts()

C2    16188
C1     9501
C0     4311
Name: LIMIT_BAL_trat, dtype: int64

In [39]:
df.loc[df['PAY_AMT1'] < 21.50 , 'PAY_AMT1_trat'] = 'C0'
df.loc[(df['PAY_AMT1'] >= 21.50) & (df['PAY_AMT1'] < 4902.50), 'PAY_AMT1_trat'] = 'C1'
df.loc[df['PAY_AMT1'] >= 4902.50, 'PAY_AMT1_trat'] = 'C2'

In [41]:
df['PAY_AMT1_trat'].value_counts()

C1    16255
C2     8334
C0     5411
Name: PAY_AMT1_trat, dtype: int64

In [42]:
df.loc[df['PAY_AMT2'] < 91.00 , 'PAY_AMT2_trat'] = 'C0'
df.loc[(df['PAY_AMT2'] >= 91.00) & (df['PAY_AMT2'] < 4966.50), 'PAY_AMT2_trat'] = 'C1'
df.loc[df['PAY_AMT2'] >= 4966.50, 'PAY_AMT2_trat'] = 'C2'

In [43]:
df['PAY_AMT2_trat'].value_counts()

C1    16351
C2     7984
C0     5665
Name: PAY_AMT2_trat, dtype: int64

In [44]:
df.loc[df['PAY_AMT3'] < 1.50 , 'PAY_AMT3_trat'] = 'C0'
df.loc[(df['PAY_AMT3'] >= 1.50) & (df['PAY_AMT3'] < 2918.50), 'PAY_AMT3_trat'] = 'C1'
df.loc[df['PAY_AMT3'] >= 2918.50, 'PAY_AMT3_trat'] = 'C2'

In [45]:
df['PAY_AMT3_trat'].value_counts()

C1    12937
C2    11082
C0     5981
Name: PAY_AMT3_trat, dtype: int64

In [46]:
df.loc[df['AVG_PAY'] < 2217.08 , 'AVG_PAY_trat'] = 'C0'
df.loc[(df['AVG_PAY'] >= 2217.08) & (df['AVG_PAY'] < 10116.92), 'AVG_PAY_trat'] = 'C1'
df.loc[df['AVG_PAY'] >= 10116.92, 'AVG_PAY_trat'] = 'C2'

In [47]:
df['AVG_PAY_trat'].value_counts()

C0    14316
C1    11982
C2     3702
Name: AVG_PAY_trat, dtype: int64

In [48]:
df['PAY_0'].value_counts()

 0    14737
-1     5686
 1     3688
-2     2759
 2     2667
 3      322
 4       76
 5       26
 8       19
 6       11
 7        9
Name: PAY_0, dtype: int64

In [50]:
df.loc[df['PAY_0']   < 1  , 'PAY_0_trat'] = 'C0'
df.loc[df['PAY_0'] == 1, 'PAY_0_trat'] = 'C1'
df.loc[df['PAY_0']   > 1  , 'PAY_0_trat'] = 'C2'

In [51]:
df['PAY_0_trat'].value_counts()

C0    23182
C1     3688
C2     3130
Name: PAY_0_trat, dtype: int64

In [52]:
df.head()

   ID   SAFRA  LIMIT_BAL  ...  PAY_AMT3_trat  AVG_PAY_trat  PAY_0_trat
0   1  200510      20000  ...             C0            C0          C2
1   2  200510     120000  ...             C1            C0          C0
2   3  200510      90000  ...             C1            C0          C0
3   4  200510      50000  ...             C1            C0          C0
4   5  200510      50000  ...             C2            C1          C0

[5 rows x 14 columns]

In [53]:
df=df[['ID','SAFRA','default', 'PAY_AMT1_trat','PAY_AMT2_trat','PAY_AMT3_trat','AVG_PAY_trat','PAY_0_trat']]

In [54]:
df.head()

   ID   SAFRA  default  ... PAY_AMT3_trat AVG_PAY_trat PAY_0_trat
0   1  200510        1  ...            C0           C0         C2
1   2  200510        1  ...            C1           C0         C0
2   3  200510        0  ...            C1           C0         C0
3   4  200510        0  ...            C1           C0         C0
4   5  200510        0  ...            C2           C1         C0

[5 rows x 8 columns]

## Divisão do conjunto de dados

In [74]:
OOT = df.loc[df['SAFRA'] >= 200605 ]
OOT['SAFRA'].groupby(OOT['SAFRA']).count()

SAFRA
200605    3000
200606    3000
200607    3000
Name: SAFRA, dtype: int64

In [75]:
DEV = df.loc[df['SAFRA'] < 200605 ]
DEV['SAFRA'].groupby(DEV['SAFRA']).count()

SAFRA
200510    3000
200511    3000
200512    3000
200601    3000
200602    3000
200603    3000
200604    3000
Name: SAFRA, dtype: int64

In [69]:
from sklearn.model_selection import train_test_split

X_train, X_test = train_test_split(DEV ,test_size=0.3, random_state=123)

In [70]:
X_train.head()

          ID   SAFRA  default  ... PAY_AMT3_trat AVG_PAY_trat PAY_0_trat
10910  10911  200601        1  ...            C2           C1         C0
12563  12564  200602        0  ...            C1           C0         C0
369      370  200510        1  ...            C1           C0         C2
7702    7703  200512        0  ...            C1           C1         C0
7464    7465  200512        0  ...            C1           C0         C0

[5 rows x 8 columns]

In [76]:
X_train.to_csv('/content/drive/MyDrive/Curso_Logistica/X_train_cat.csv',index=None)
X_test.to_csv('/content/drive/MyDrive/Curso_Logistica/X_test_cat.csv',index=None)